data = {
    "❇️Орфография": {
        "Н-НН": {
            "photos": [ "Н-НН0", "Н-НН1", "Н-НН2", "Н-НН3" ],
            "questions": [
                {
                    "vopros": "В каком слове пишется одна Н?",
                    "variants": [
                        "Закопчен...ые стены",
                        "Трава подстрижен...а",
                        "Неждан...ый",
                        "Услышан...ая мною история"
                    ],
                    "correct": "Трава подстрижен...а"
                },
                {
                    "vopros": "В каком слове пишется одна Н?",
                    "variants": [
                        "Свежезаморожен...ые овощи",
                        "Швы отстрочен...ы",
                        "Перевязан...ая",
                        "Вязан...ые бабушкой носки"
                    ],
                    "correct": "Швы отстрочен...ы"
                },
                {
                    "vopros": "В каком слове на месте пропуска пишется одна Н?",
                    "variants": [
                        "Общепризнан...ое мнение",
                        "Сушен...ые в печи грибы",
                        "Стилизован...ый интерьер",
                        "Морожен...ая рыба"
                    ],
                    "correct": "Морожен...ая рыба"
                },
                {
                    "vopros": "В каком примере на месте пропуска пишется две буквы НН?",
                    "variants": [
                        "Румян..ый младенец",
                        "некраше...ый забор",
                        "Неслыхан...ый скандал",
                        "Невкусный жжен..ый кофе"
                    ],
                    "correct": "Неслыхан...ый скандал"
                },
                {
                    "vopros": "В каком примере на месте пропуска пишется две буквы НН?",
                    "variants": [
                        "Посажен...ый отец",
                        "Неметен...ый пол",
                        "Балован...ый ребенок",
                        "Сушен...ые грибы"
                    ],
                    "correct": "Балован...ый ребенок"
                },
                {
                    "vopros": "В каком варианте ответа правильно указаны все цифры, на месте которых пишется две буквы НН?\n Она пересекла площадь, вымоще( 1 )ую крупным глянцевым булыжником, миновала стари(2)ые торговые ряды и вышла на тихую, затенё(3)ую тополями улицу.",
                    "variants": [
                        "1, 2, 3",
                        "1, 2",
                        "2, 3",
                        "1, 3"
                    ],
                    "correct": "1, 2, 3"
                },
                {
                    "vopros": "В каком варианте ответа правильно указаны все слова, в которых на месте пропуска пишется две буквы НН?\n A. Сгущё...ое молоко, утомлё...ые солнцем \n Б. Свежезаваре...ый чай, не езже...ая с осени дорога \n В. Да...ое условие, иллюзии утраче...ы \n Г. Решё...ая задача, смышлё...ый ученик ",
                    "variants": [
                        "А, Б, Г",
                        "А, Г",
                        "В, Г",
                        "А, Б"
                    ],
                    "correct": "А, Б"
                },
                {
                    "vopros": "В каком слове пишется одна Н?",
                    "variants": [
                        "Обоснован...ый вывод",
                        "Избалован...ый ребенок",
                        "Площадь оцеплен...а",
                        "Асфальтирован...ая улица"
                    ],
                    "correct": "Площадь оцеплен...а"
                },
                {
                    "vopros": "В каком слове пишется НН?",
                    "variants": [
                        "Ранен...ый боец",
                        "Кожан...ое кресло",
                        "Юн...ый возраст",
                        "Воспитан...ый человек"
                    ],
                    "correct": "Воспитан...ый человек"
                },
                {
                    "vopros": "В каком предложении содержится слово с двумя НН?",
                    "variants": [
                        "Учительница строга и сдержан...а",
                        "Девушка хорошо воспитан...а родителями",
                        "Задача решен...а правильно",
                        "Работа выполнен...а безупречно"
                    ],
                    "correct": "Учительница строга и сдержан...а"
                },
                {
                    "vopros": "В каком предложении содержится слово с двумя НН?",
                    "variants": [
                        "Участки застроен...ы",
                        "У работников предприятия ненормирован...ый рабочий день",
                        "Во двор въехала гружен...ая машина",
                        "Поля засеян...ы пшеницей"
                    ],
                    "correct": "У работников предприятия ненормирован...ый рабочий день"
                },
                {
                    "vopros": "В каком варианте содержится слово с двумя НН?",
                    "variants": [
                        "свежемороже...ая рыба",
                        "копче...ая колбаса",
                        "суше...ые яблоки",
                        "девочка рассея...а"
                    ],
                    "correct": "девочка рассея...а"
                }

            ]
        },
        "НЕ - слитно/раздельно": {
            "photos": [ "НЕ - слитно и раздельно0", "НЕ - слитно и раздельно1" ],
            "questions": [
                {
                    "vopros": "В каком варианте НЕ пишется раздельно?",
                    "variants": [
                        "(Не)прерывное (не)домогание",
                        "Мне это вовсе (не)интересно",
                        "(Не)вежда",
                        "Это было (не)избежно"
                    ],
                    "correct": "Мне это вовсе (не)интересно"
                },
                {
                    "vopros": "В каком варианте НЕ пишется раздельно?",
                    "variants": [
                        "Совершить (не)лепый поступок",
                        "Бормотать что-то (не)внятное",
                        "Ничем (не)оправданный риск",
                        "Юноша крайне (не)вежлив"
                    ],
                    "correct": "Ничем (не)оправданный риск"
                },
                {
                    "vopros": "В каком варианте НЕ пишется раздельно?",
                    "variants": [
                        "В пачке (не)достает трех тетрадей",
                        "(Не)взлюбить с первого взгляда",
                        "(Не)зная причины",
                        "Обошлось (не)дешево"
                    ],
                    "correct": "(Не)зная причины"
                },
                {
                    "vopros": "В каких словах НЕ пишется слитно",
                    "variants": [
                        "(Не)навидит болезнь",
                        "(Не)ломает ветки деревьев",
                        "(Не)оставит друга",
                        "(Не)рвет лесных цветов",
                        "(Не)следует ловить"
                    ],
                    "correct": "(Не)навидит болезнь"
                },
                {
                    "vopros": "В каком варианте НЕ пишется раздельно?",
                    "variants": [
                        "Работа (не)зачтена",
                        "Вести себя (не)принужденно",
                        "(Не)приступная крепость",
                        "С утра (не)здоровится"
                    ],
                    "correct": "Работа (не)зачтена"
                },
                {
                    "vopros": "В каком примере НЕ пишется слитно?",
                    "variants": [
                        "Многие рукописи (не)расшифрованы",
                        "В книге (не)хватало нескольких страниц",
                        "Нам (не)доставало терпенья и опыта",
                        "Есть на земле люди, (не)знающие, что такое снег"
                    ],
                    "correct": "Нам (не)доставало терпенья и опыта"
                },
                {
                    "vopros": "Раскройте скобки. Отметьте то предложение, в котором глаголы пишутся с НЕ слитно",
                    "variants": [
                        "(Не) трудиться, так и хлеба (не) добиться",
                        "Мне в этот день (не) здоровилось",
                        "С людьми браниться – никуда (не)годится",
                        "(Не)лает, не кусает, а в дом (не)пускает"
                    ],
                    "correct": "Мне в этот день (не) здоровилось"
                },
                {
                    "vopros": "Укажите слитное написание частицы НЕ",
                    "variants": [
                        "далеко (не)робкое замечание",
                        "(не)у кого остановиться",
                        "ничуть (не)дорог",
                        "(не)здоровый цвет лица"
                    ],
                    "correct": "(не)здоровый цвет лица"
                },
                {
                    "vopros": "Отметьте строку, в которой все слова пишутся с НЕ слитно",
                    "variants": [
                        "(не)брежный, ничуть (не)привлекательный, (не)взгоды",
                        "(не)доумение, (не)видел, (не)догадливый",
                        "(не)доразумение, (не)кем, (не)взлюбил",
                        "(не)хороший; (не)посметь; (не)кто"
                    ],
                    "correct": "(не)доразумение, (не)кем, (не)взлюбил"
                },
                {
                    "vopros": "Отметьте строку, в которой все слова пишутся с НЕ раздельно",
                    "variants": [
                        "(не)лепость, (не)годовал, (не)красивый",
                        "(не) (с) кем, (не)думал, далеко (не) робкий",
                        "(не)красивый, (не)хотя, (не) (о) чем",
                        "(не)широкая, но глубокая; (не)понял, (не)вразумительный"
                    ],
                    "correct": "(не) (с) кем, (не)думал, далеко (не) робкий"
                }
            ]
        },
        "Чередующиеся корни": {
            "photos": [ "Чередующиеся корни0" ],
            "questions": [
                {
                    "vopros": "В каком слове в корне на месте пропуска пишется А?",
                    "variants": [
                        "интересное предпол...жение",
                        "написать изл...жение",
                        "распол...житься на ночлег",
                        "предл...гать конфету"
                    ],
                    "correct": "предл...гать конфету"
                },
                {
                    "vopros": "В каком слове в корне на месте пропуска пишется буква О?",
                    "variants": [
                        "хорошо изл...гать",
                        "изучать прил...гательное",
                        "дол...жить о прибытии",
                        "пол...гаться на товарища"
                    ],
                    "correct": "дол...жить о прибытии"
                },
                {
                    "vopros": "Укажите слово, в котором на месте пропуска пишется буква О",
                    "variants": [
                        "сильный р...сток",
                        "выр..щенный на даче",
                        "р...стительный орнамент",
                        "быстро подр...стать"
                    ],
                    "correct": "сильный р...сток"
                },
                {
                    "vopros": "В каком слове пишется буква А?",
                    "variants": [
                        "отр...сль",
                        "подр...сли",
                        "пр...снуться",
                        "разг...реться"
                    ],
                    "correct": "отр...сль"
                },
                {
                    "vopros": "В каком слове пишется буква И?",
                    "variants": [
                        "расст...лить",
                        "зат...реть",
                        "отп...реть",
                        "разб...рать"
                    ],
                    "correct": "разб...рать"
                },
                {
                    "vopros": "В каком слове пишется буква А?",
                    "variants": [
                        "г...рница",
                        "г...рящий",
                        "прик...саться",
                        "г...рение"
                    ],
                    "correct": "прик...саться"
                },
                {
                    "vopros": "В каком слове пишется буква О?",
                    "variants": [
                        "з..рница",
                        "г...рящий",
                        "прик...саться",
                        "оз..рение"
                    ],
                    "correct": "г...рящий"
                },
                {
                    "vopros": "В каком слове пишется буква А?",
                    "variants": [
                        "г..рение",
                        "р..сток",
                        "пор..сль",
                        "к..сание"
                    ],
                    "correct": "к..сание"
                },
                {
                    "vopros": "В каком слове пишется буква И?",
                    "variants": [
                        "раст...рание",
                        "ст...литься",
                        "зам...реть",
                        "отт...реть"
                    ],
                    "correct": "раст...рание"
                },
                {
                    "vopros": "В каком ряду во всех словах пропущена буква О?",
                    "variants": [
                        "з...ря, сл...жение, подр...сли",
                        "к...саться, р...стовщик, пор...сль",
                        "предл...жение, р...стовский, выг...реть",
                        "самовозг...раемость, предл...гать, р...стение"
                    ],
                    "correct": "предл...жение, р...стовский, выг...реть"
                },
                {
                    "vopros": "В каком примере на месте пропуска пишется О",
                    "variants": [
                        "р...внина",
                        "ср...внить ответы",
                        "подр...внять волосы",
                        "нар...вне"
                    ],
                    "correct": "подр...внять волосы"
                },
                {
                    "vopros": "Укажите слово, в котором на месте пропуска пишется А",
                    "variants": [
                        "пл...вец",
                        "попл...вок",
                        "пл...вчиха",
                        "пл...вцы"

                    ],
                    "correct": "попл...вок"
                },
                {
                    "vopros": "Укажите вариант, в котором на месте пропуска пишется Е",
                    "variants": [
                        "соч...тание",
                        "пон...мать",
                        "обн...мать",
                        "нач..нать",
                        "Во всех пишется И"

                    ],
                    "correct": "соч...тание"
                }
            ]
        },

        "Спряжения глаголов": {
            "photos": [ "Спряжения глаголов0" ],
            "questions": [
                {
                    "vopros": "Выбери слово, обозначающее глагол 1 спряжения:",
                    "variants": [
                        "следите",
                        "бегаешь",
                        "верит",
                        "чистим"
                    ],
                    "correct": "бегаешь"
                },
                {
                    "vopros": "Выбери слово, обозначающее глагол 2 спряжения:",
                    "variants": [
                        "наступает",
                        "летают",
                        "замолкнешь",
                        "строишь"
                    ],
                    "correct": "строишь"
                },
                {
                    "vopros": "Выбери слово, которое обозначает глагол - исключение:",
                    "variants": [
                        "сидеть",
                        "слышать",
                        "возить",
                        "читать"
                    ],
                    "correct": "слышать"
                },
                {
                    "vopros": "Выбери глагол с буквой И в окончании:",
                    "variants": [
                        "побре...т",
                        "заболе...т",
                        "поигра...т",
                        "налов...т"
                    ],
                    "correct": "налов...т"
                },
                {
                    "vopros": "Выбери глагол с буквой Е в окончании:",
                    "variants": [
                        "дыш...т",
                        "вид...м",
                        "увелич...т",
                        "встреча...шь"
                    ],
                    "correct": "встреча...шь"
                },
                {
                    "vopros": "Выбери ряд, в котором во всех словах пропущена буква Е:",
                    "variants": [
                        "услыш...м, рису...шь",
                        "покорм...шь, урон...т",
                        "обраду...шь, стро...те",
                        "се...м, заработа...те"
                    ],
                    "correct": "се...м, заработа...те"
                },
                {
                    "vopros": "Выбери ряд, в котором во всех словах пропущена буква И:",
                    "variants": [
                        "помога...шь, замерза...м",
                        "держ...те, растоп...т",
                        "сдела...шь, балу...шь",
                        "тащ...м, пролета...м"
                    ],
                    "correct": "держ...те, растоп...т"
                },
                {
                    "vopros": "Укажите глагол 1 спряжения:",
                    "variants": [
                        "задержать",
                        "искать",
                        "перегнать"
                    ],
                    "correct": "искать"
                },
                {
                    "vopros": "В окончании какого глагола пропущена буква И?",
                    "variants": [
                        "заслуша...шься",
                        "беспоко...шься",
                        "бор...шься",
                        "задремл..шь"
                    ],
                    "correct": "беспоко...шься"
                },
                {
                    "vopros": "В окончании какого глагола пропущена буква Е?",
                    "variants": [
                        "вытерп...шь",
                        "мерещ...шься",
                        "пропол...шь",
                        "гон...шься"
                    ],
                    "correct": "пропол...шь"
                },
                {
                    "vopros": "В окончании какого глагола пропущена буква Е?",
                    "variants": [
                        "ненавид...шь",
                        "держ...шься",
                        "долож...шь",
                        "рокоч...шь"
                    ],
                    "correct": "рокоч...шь"
                },
                {
                    "vopros": "В каком ряду в обоих словах пропущена буква И?",
                    "variants": [
                        "выдвин...шь, верт...шься",
                        "догон...шь, накорм...шь",
                        "исчезн...шь, затихн...шь",
                        "закле...шь, распаш...шь"
                    ],
                    "correct": "догон...шь, накорм...шь"
                },
                {
                    "vopros": "В каком ряду в обоих словах на месте пропусков пишется буква Е?",
                    "variants": [
                        "бре...шься, искалеч...шь",
                        "захоч...шь, выуч...шь",
                        "пересуш...шь, постигн...шь",
                        "поигра...ешь, танцу...шь"
                    ],
                    "correct": "поигра...ешь, танцу...шь"
                }
            ]
        },
        "Буквы А/О на конце наречий": {
            "photos": [ "Буквы А-О на конце наречий0" ],
            "questions": [
                {
                    "vopros": "В каком наречии пропущена буква О?",
                    "variants": [
                        "вправ...",
                        "издавн...",
                        "дополн...",
                        "донаг..."
                    ],
                    "correct": "вправ..."
                },
                {
                    "vopros": "В каком наречии пропущена буква А?",
                    "variants": [
                        "безнадёжн...",
                        "изначальн...",
                        "набел...",
                        "сначал..."
                    ],
                    "correct": "сначал..."
                },
                {
                    "vopros": "В каком наречии пропущена буква О?",
                    "variants": [
                        "дотемн...",
                        "изредк...",
                        "нередк...",
                        "справ..."
                    ],
                    "correct": "нередк..."
                },
                {
                    "vopros": "В каком наречии пропущена буква О?",
                    "variants": [
                        "насух...",
                        "досух...",
                        "досыт...",
                        "искос..."
                    ],
                    "correct": "насух..."
                },
                {
                    "vopros": "В каком наречии пропущена буква О?",
                    "variants": [
                        "сызнов...",
                        "занов...",
                        "снов...",
                        "сызмал..."
                    ],
                    "correct": "занов..."
                },
                {
                    "vopros": "В каком наречии пропущена буква А?",
                    "variants": [
                        "дословн...",
                        "занов...",
                        "дочерн...",
                        "досрочн..."
                    ],
                    "correct": "дочерн..."
                },
                {
                    "vopros": "В каком наречии пропущена буква А?",
                    "variants": [
                        "замертв...",
                        "втридорог...",
                        "влев...",
                        "нагол..."
                    ],
                    "correct": "втридорог..."
                },
                {
                    "vopros": "В каком наречии пропущена буква А?",
                    "variants": [
                        "изысканн...",
                        "дочист...",
                        "недорог...",
                        "недостаточн..."
                    ],
                    "correct": "дочист..."
                }
            ]
        },
        "Наречия Слитно/Раздельно": {
            "photos": [ "Наречия Слитно-Раздельно0" ],
            "questions": [
                {
                    "vopros": "Укажите вариант ответа со слитным написанием:",
                    "variants": [
                        "(в)одиночку",
                        "(в)крутую",
                        "(в)открытую",
                        "(в)обхват"
                    ],
                    "correct": "(в)крутую"
                },
                {
                    "vopros": "Укажите вариант ответа с раздельным написанием:",
                    "variants": [
                        "(в)ничью",
                        "(в)кратце",
                        "(в)заперти",
                        "(в)диковинку"
                    ],
                    "correct": "(в)диковинку"
                },
                {
                    "vopros": "Укажите вариант ответа со слитным написанием:",
                    "variants": [
                        "(в)разброс",
                        "(в)насмешку",
                        "(в)отместку",
                        "(в)шутку"
                    ],
                    "correct": "(в)разброс"
                },
                {
                    "vopros": "Укажите вариант ответа с раздельным написанием:",
                    "variants": [
                        "(в)развалочку",
                        "(в)обтяжку",
                        "(в)разнобой",
                        "(в)рассыпную"
                    ],
                    "correct": "(в)обтяжку"
                },
                {
                    "vopros": "Укажите вариант ответа со слитным написанием:",
                    "variants": [
                        "(на)боковую",
                        "(на)перерез",
                        "(на)века",
                        "(на)износ"
                    ],
                    "correct": "(на)перерез"
                },
                {
                    "vopros": "Укажите вариант ответа со слитным написанием:",
                    "variants": [
                        "(на)лету",
                        "(на)плаву",
                        "(на)редкость",
                        "(на)пролёт"
                    ],
                    "correct": "(на)пролёт"
                },
                {
                    "vopros": "Укажите вариант ответа с раздельным написанием:",
                    "variants": [
                        "(на)коротке",
                        "(на)крепко",
                        "(на)радостях",
                        "(на)бок"
                    ],
                    "correct": "(на)радостях"
                },
                {
                    "vopros": "В каком случае наречие пишется слитно?",
                    "variants": [
                        "держать (на)весу",
                        "встал (с)позаранку",
                        "быть (на)побегушках"
                    ],
                    "correct": "встал (с)позаранку"
                },
                {
                    "vopros": "В каком случае наречие пишется слитно?",
                    "variants": [
                        "выстрелил (в)упор",
                        "приехал (на)днях",
                        "сжечь (до)тла"
                    ],
                    "correct": "сжечь (до)тла"
                },
                {
                    "vopros": "В каком случае наречие пишется раздельно?",
                    "variants": [
                        "рыдала (на)взрыд",
                        "схватить (без)спросу",
                        "решал (в)торопях"
                    ],
                    "correct": "схватить (без)спросу"
                },
                {
                    "vopros": "В каком случае наречие пишется раздельно?",
                    "variants": [
                        "брать (с)наскока",
                        "грезить (на)яву",
                        "упал (на)взничь"
                    ],
                    "correct": "брать (с)наскока"
                },
                {
                    "vopros": "В каком случае наречие пишется раздельно?",
                    "variants": [
                        "разбил (в)дребезги",
                        "врать (без)зазрения совести",
                        "бормотал (в)просонках"
                    ],
                    "correct": "врать (без)зазрения совести"
                }
            ]
        },
        "Дефис": {
            "photos": [ "Дефис0", "Дефис1" ],
            "questions": [
                {
                    "vopros": "В каком случае слово пишется через дефис",
                    "variants": [
                        "пол…ложки",
                        "пол…жизни",
                        "пол...королевства",
                        "пол…стакана"
                    ],
                    "correct": "пол…ложки"
                },
                {
                    "vopros": "В каком случае слово пишется через дефис",
                    "variants": [
                        "пол…четвертого",
                        "пол…яблока",
                        "пол…картошки",
                        "пол…минуты"
                    ],
                    "correct": "пол…яблока"
                },
                {
                    "vopros": "В каком варианте дефис поставлен неверно",
                    "variants": [
                        "кое-как",
                        "где-либо",
                        "унтер-офицер",
                        "аэро-сани"
                    ],
                    "correct": "аэро-сани"
                },
                {
                    "vopros": "Выберите ряд, в котором все слова пишутся через дефис",
                    "variants": [
                        "что…нибудь; как…то; пол…десятого",
                        "Нью…Йорк; яхт…клуб; лексико…грамматический",
                        "русско…французский словарь; квази…постоянные; пол…яхты"
                    ],
                    "correct": "Нью…Йорк; яхт…клуб; лексико…грамматический"
                },
                {
                    "vopros": "Выберите слово, которое пишется слитно",
                    "variants": [
                        "суб…орбитальный",
                        "военно…промышленный",
                        "зелено…голубой"
                    ],
                    "correct": "суб…орбитальный"
                },
                {
                    "vopros": "Выберите вариант, который пишется без дефиса",
                    "variants": [
                        "чуть...чуть",
                        "кое…как",
                        "один...в...один"
                    ],
                    "correct": "один...в...один"
                },
                {
                    "vopros": "Выберите вариант, в котором слово пишется с дефисом",
                    "variants": [
                        "бок...о...бок",
                        "след...в...след",
                        "точь…в…точь",
                        "душа...в...душу"
                    ],
                    "correct": "точь…в…точь"
                },
                {
                    "vopros": "Выберите вариант, в котором слово пишется с дефисом",
                    "variants": [
                        "горно…спасательная",
                        "поли…витамины",
                        "денежно…кредитная(политика)"
                    ],
                    "correct": "денежно…кредитная(политика)"
                },
                {
                    "vopros": "Выберите вариант, в котором слова пишутся раздельно и без дефиса",
                    "variants": [
                        "жизненно(?)важный",
                        "истинно(?)полезный",
                        "абсолютно(?)скучный",
                        "крайне(?)неприятный",
                        "во всех вариантах слова пишутся раздельно"
                    ],
                    "correct": "во всех вариантах слова пишутся раздельно"
                },
                {
                    "vopros": "Выберите вариант, в котором слово пишется слитно",
                    "variants": [
                        "мало(?)заметный",
                        "густо(?)населенный",
                        "много(?)уважаемый",
                        "слабо(?)соленый",
                        "во всех вариантах слова пишутся слитно"
                    ],
                    "correct": "во всех вариантах слова пишутся слитно"
                }
            ]
        },
        "Приставки ПРЕ/ПРИ": {
            "photos": [ "Приставки ПРЕ- и ПРИ-0", "Приставки ПРЕ- и ПРИ-1" ],
            "questions": [
                {
                    "vopros": "Выбери слово, в котором в приставке пишется Е",
                    "variants": [
                        "пр…открыть",
                        "пр…успеть",
                        "пр…бавить"
                    ],
                    "correct": "пр…успеть"
                },
                {
                    "vopros": "Какая буква пишется на месте знака вопроса: пр(?)бывать (находиться) в неведении",
                    "variants": [
                        "Е",
                        "И"
                    ],
                    "correct": "Е"
                },
                {
                    "vopros": "Выберите слово, в котором в приставке пишется И",
                    "variants": [
                        "пр…интересный",
                        "пр…неприятный",
                        "пр…думать"
                    ],
                    "correct": "пр…думать"
                },
                {
                    "vopros": "Какая буква должная стоять на месте знака вопроса в слове пр(?)небрегать",
                    "variants": [
                        "Е",
                        "И"
                    ],
                    "correct": "Е"
                },
                {
                    "vopros": "Выберите слово, которое написано с ошибкой",
                    "variants": [
                        "приплясывать",
                        "присвистывать",
                        "прегорелый"
                    ],
                    "correct": "прегорелый"
                },
                {
                    "vopros": "Выберите ряд, в котором во всех словах пишется Е",
                    "variants": [
                        "пр…вращать; пр…одолеть; пр…емлемый",
                        "пр…своить; пр…учить; пр…вышать",
                        "пр…дерзкий; пр…града; пр…зидент"
                    ],
                    "correct": "пр…дерзкий; пр…града; пр…зидент"
                },
                {
                    "vopros": "Какая буква пишется в слове пр…тендент",
                    "variants": [
                        "Е",
                        "И"
                    ],
                    "correct": "Е"
                },
                {
                    "vopros": "Выберите слово, в котором в приставке пишется И",
                    "variants": [
                        "пр…стиж",
                        "пр…говорить (к смертной казни)",
                        "пр…восходить"
                    ],
                    "correct": "пр…говорить (к смертной казни)"
                },
                {
                    "vopros": "Какая буква должна стоять на месте знака вопроса\n пр(?)дел возможностей",
                    "variants": [
                        "Е",
                        "И"
                    ],
                    "correct": "Е"
                },
                {
                    "vopros": "Выберите пару, в которой во всех словах пишется Е",
                    "variants": [
                        "пр…мадонна; пр…зент",
                        "пр…ватный; пр…митивный",
                        "пр…амбула; пр…рогатива"
                    ],
                    "correct": "пр…амбула; пр…рогатива"
                },
                {
                    "vopros": "Выберите вариант, в котором на месте пропуска пишется И",
                    "variants": [
                        "пр...зирать",
                        "пр...пятствие",
                        "пр...ходящее явление",
                        "пр...скорбный"
                    ],
                    "correct": "пр...скорбный"
                }
            ]
        },
        "Частицы НЕ и НИ":{
            "photos": [ "Частицы НЕ и НИ0" ],
            "questions": [
                {
                    "vopros": "Выберите вариант, в котором на месте пропуска пишется И",
                    "variants": [
                        "н... о чем думать",
                        "н... в чем не нуждаюсь",
                        "н...сколько лет",
                        "н...кем заменить"
                    ],
                    "correct": "н... в чем не нуждаюсь"
                },
                {
                    "vopros": "Выберите вариант, в котором на месте пропуска пишется Е",
                    "variants": [
                        "н... во что теперь верить",
                        "н... у кого не спросишь",
                        "н... у кого просить не буду",
                        "н... во что не верю"
                    ],
                    "correct": "н... во что теперь верить"
                },
                {
                    "vopros": "Выберите вариант, в котором на месте пропуска пишется Е",
                    "variants": [
                        "н...кому нет дела до меня",
                        "н...кто не забыт",
                        "н... с кем поговорить",
                        "н... с кем не хочется разговаривать"
                    ],
                    "correct": "н... с кем поговорить"
                },
                {
                    "vopros": "Выберите вариант, в котором на месте пропуска пишется И",
                    "variants": [
                        "н...чему радоваться",
                        "н...чего делать",
                        "н...кого любить",
                        "н...чего не случится"
                    ],
                    "correct": "н...чего не случится"
                },
                {
                    "vopros": "Выберите вариант, в котором на месте пропуска пишется Е",
                    "variants": [
                        "н... от кого не слышал",
                        "н...чего не делаешь",
                        "н...чего сказать",
                        "н...чего не знает"
                    ],
                    "correct": "н...чего сказать"
                },
                {
                    "vopros": "Выберите вариант, в котором на месте пропуска пишется И",
                    "variants": [
                        "н... о ком говорить",
                        "н...кого удивить",
                        "н...чего говорить",
                        "н... о ком не говорят"
                    ],
                    "correct": "н... о ком не говорят"
                },
                {
                    "vopros": "Выберите вариант, в котором на месте пропуска пишется Е",
                    "variants": [
                        "н...чем не хвались",
                        "н...чьему добру не завидуй",
                        "н...чем хвалиться",
                        "н...кто не был рад"
                    ],
                    "correct": "н...чем хвалиться"
                },
                {
                    "vopros": "Выберите вариант, в котором на месте пропуска пишется И",
                    "variants": [
                        "н...кому прийти на помощь",
                        "н...сколько не стоит",
                        "дай мне н...сколько монет",
                        "н... с кем встретиться"
                    ],
                    "correct": "н...сколько не стоит"
                },
                {
                    "vopros": "Выберите вариант, в котором на месте пропуска пишется Е",
                    "variants": [
                        "н... с кем не поделился",
                        "н...кто не мог заснуть",
                        "н... раз выручал",
                        "не потерплю н... в ком"
                    ],
                    "correct": "н... раз выручал"
                },
                {
                    "vopros": "Выберите вариант, в котором на месте пропуска пишется И",
                    "variants": [
                        "н...кому подарить",
                        "н... о чем беспокоиться",
                        "н... с чем бороться",
                        "н... о чем не беспокоюсь"
                    ],
                    "correct": "н... о чем не беспокоюсь"
                },
                {
                    "vopros": "Выберите вариант, в котором на месте пропуска пишется Е",
                    "variants": [
                        "как н… в чём не бывало",
                        "н… мог не сказать",
                        "кругом н… души",
                        "кто бы то н… был"
                    ],
                    "correct": "н… мог не сказать"
                },
                {
                    "vopros": "Выберите вариант, в котором на месте пропуска пишется И",
                    "variants": [
                        "не сравниться н… с чем",
                        "сделал н… задумываясь",
                        "н…кстати",
                        "н… по дням, а по часам"
                    ],
                    "correct": "не сравниться н… с чем"
                },
                {
                    "vopros": "Выберите вариант, в котором на месте пропуска пишется Е",
                    "variants": [
                        "н… жив н… мертв",
                        "н… к селу н… к городу",
                        "дорога в н…куда",
                        "н… мог н… приехать",
                        "н… в сказке сказать"
                    ],
                    "correct": "н… мог н… приехать"
                }
                

            ]
        },
        "Буквы И/Ы после приставок": {
            "photos": [ "Буквы И-Ы после приставок0" ],
            "questions": [
                {
                    "vopros": "Выберите пару, в которой во всех словах пишется Ы",
                    "variants": [
                        "дез…нфекцию; без…мянная",
                        "вз…мать; без…нвентарный",
                        "без…сходность;  без…дейный"
                    ],
                    "correct": "без…сходность;  без…дейный"
                },
                {
                    "vopros": "Выберите слово, в котором на месте пропуска пишется И",
                    "variants": [
                        "вз…мающий (пошлину)", 
                        "без…скусный",
                        "об…грать"
                    ],
                    "correct": "вз…мающий (пошлину)"
                },
                {
                    "vopros": "Выберите слово, в котором на месте пропуска пишется И",
                    "variants": [
                        "меж…гровой",  
                        "пред…стория",
                        "без…скусственный"
                    ],
                    "correct": "меж…гровой"
                },
                {
                    "vopros": "Выберите ряд, в котором во всех словах на месте пропуска пишется И",
                    "variants": [
                        "сан…нспекция; трёх…мпульсный",
                        "мед…нститут; вз...скать",
                        "без…глое (растение); с...грать" 
                    ],
                    "correct": "сан…нспекция; трёх…мпульсный"
                },
                {
                    "vopros": "Выберите слово, в котором на месте пропуска пишется Ы",
                    "variants": [
                        "супер…нтеллигентный",
                        "транс…ранские",
                        "над…ндивидуальный",
                        "без…нвентарное" 
                    ],
                    "correct": "без…нвентарное"
                },
                {
                    "vopros": "Выберите слово, в котором на месте пропуска пишется И",
                    "variants": [
                        "без…скровая",
                        "вз…гравшее",
                        "с…змальства",
                        "вз…мать"
                    ],
                    "correct": "вз…мать"
                },
                {
                    "vopros": "Выберите пару, в которой во всех словах пишется Ы",
                    "variants": [
                        "из…скать; меж…нститутский",
                        "с…митировать; пред…дущий", 
                        "небез…звестный; пред…юльский"
                    ],
                    "correct": "с…митировать; пред…дущий"
                },
                {
                    "vopros": "Выберите пару, в которой во всех словах пишется И",
                    "variants": [
                        "сверх…зысканный; двух…мпульсный",
                        "пред…нфарктное; под…грывать",
                        "от…мённые;  пред…стория"
                    ],
                    "correct": "сверх…зысканный; двух…мпульсный"
                }
            ]
        },
        "Разделительные Ъ/Ь знаки": {
            "photos": [ "Разделительный Ъ и Ь знаки0" ],
            "questions": [
                {
                    "vopros": "Выберите вариант, в котором на месте пропуска пишется Ъ",
                    "variants": [
                        "руж..ё",
                        "под..езд",
                        "кар..ера",
                        "в..юга"
                    ],
                    "correct": "под..езд"
                },
                {
                    "vopros": "Выберите вариант, в котором на месте пропуска пишется Ъ",
                    "variants": [
                        "солов..иная трель",
                        "комп..ютер",
                        "об..явление",
                        "бур..ян"
                    ],
                    "correct": "об..явление"
                },
                {
                    "vopros": "Выберите вариант, в котором на месте пропуска пишется Ъ",
                    "variants": [
                        "вороб..и",
                        "п..еса",
                        "мурав..ед",
                        "пред..юбилейный"
                    ],
                    "correct": "пред..юбилейный"
                },
                {
                    "vopros": "Выберите вариант, в котором на месте пропуска пишется Ъ",
                    "variants": [
                        "пол..ёт цветы",
                        "об..скакать",
                        "об..езжать вокруг",
                        "в..ётся по стене"
                    ],
                    "correct": "об..езжать вокруг"
                },
                {
                    "vopros": "Выберите вариант, в котором на месте пропуска пишется Ъ",
                    "variants": [
                        "ател..е",
                        "плат..е",
                        "солов..и",
                        "ад…ютант"
                    ],
                    "correct": "ад…ютант"
                },
                {
                    "vopros": "Выберите вариант, в котором на месте пропуска пишется Ъ",
                    "variants": [
                        "прем..ера",
                        "птич..и голоса",
                        "пред..явить пропуск",
                        "бул..он"
                    ],
                    "correct": "пред..явить пропуск"
                },
                {
                    "vopros": "Выберите вариант, в котором на месте пропуска пишется Ъ",
                    "variants": [
                        "трех…ярусный",
                        "без..аварийный",
                        "медвеж..я услуга",
                        "бар..ер"
                    ],
                    "correct": "трех…ярусный"
                },
                {
                    "vopros": "Выберите вариант, в котором на месте пропуска пишется Ь",
                    "variants": [
                        "с..ёжиться от холода",
                        "друз..я",
                        "раз..яснить",
                        "с..едобный гриб"
                    ],
                    "correct": "друз..я"
                },
                {
                    "vopros": "Выберите вариант, в котором на месте пропуска пишется Ь",
                    "variants": [
                        "с..ешь суп",
                        "об..единиться",
                        "об..учить",
                        "сер..ёзный"
                    ],
                    "correct": "сер..ёзный"
                },
                {
                    "vopros": "Выберите вариант, в котором на месте пропуска пишется Ь",
                    "variants": [
                        "интер..ер",
                        "с..емка",
                        "с..язвить",
                        "в..ехать"
                    ],
                    "correct": "интер..ер"
                }
            ]
        },
        "Буквы О/Ё после шипящих": {
            "photos": [ "Буквы О-Ё после шипящих0" ],
            "questions": [
                {
                    "vopros": "Выберите слово, в котором на месте пропуска пишется О",
                    "variants": [
                        "Щ…тка",
                        "ч…лка",
                        "алыч…вый",
                        "зач…т"
                    ],
                    "correct": "алыч…вый"
                },
                {
                    "vopros": "Выберите слово, в котором на месте пропуска пишется Ё",
                    "variants": [
                        "дириж…р",
                        "морж…вый",
                        "реч…нка",
                        "девч…нка"
                    ],
                    "correct": "дириж…р"
                },
                {
                    "vopros": "Выберите слово, которое написано с ошибкой",
                    "variants": [
                        "(договориться с) торгашем",
                        "обжора",
                        "жесткий",
                        "шепот"
                    ],
                    "correct": "(договориться с) торгашем"
                },
                {
                    "vopros": "Выберите пару, в которой во всех словах пишется Ё",
                    "variants": [
                        "(сильный) ож…г; камыш…вый",
                        "Ерш…вый; парч…вый",
                        "(хулиган) подж…г (сено); (был) смещ…н",
                        "ч…порный; крыж…вник"
                    ],
                    "correct": "(хулиган) подж…г (сено); (был) смещ…н"
                },
                {
                    "vopros": "Выберите вариант, который написан правильно",
                    "variants": [
                        "зачот", 
                        "бечёвка",  
                        "пшонка",
                        "сушоный"
                    ],
                    "correct": "бечёвка"
                },
                {
                    "vopros": "Выберите вариант, который написан неправильно",
                    "variants": [
                        "медвежонок",
                        "(стать) моржом",
                        "жонглёр",
                        "огорчён",
                        "все правильные"
                    ],
                    "correct": "все правильные"
                },
                {
                    "vopros": "Выберите слово, в котором на месте пропуска пишется О",
                    "variants": [
                        "толч…ный",
                        "мощ…ный",
                        "холщ…вый",
                        "грач…вый"
                    ],
                    "correct": "холщ…вый"
                },
                {
                    "vopros": "Выберите вариант, который написан неправильно",
                    "variants": [
                        "дружок",
                        "маячок",
                        "саранчой",
                        "гаражом",
                        "(доволен) жолобом"
                    ],
                    "correct": "(доволен) жолобом"
                }
            ]
        },
        "Суффиксы глаголов": {
            "photos": [ "Суффиксы ИВА ЫВА, ОВА ЕВА0" ],
            "questions": [
                {
                    "vopros": "Выберите слово, в котором на месте пропуска пишется ЕВА",
                    "variants": [
                        "опраш…вать",
                        "изготавл…вать",
                        "сопереж…вать",
                        "растуш…вать"
                    ],
                    "correct": "растуш…вать"
                },
                {
                    "vopros": "Какая буква должна стоять на месте знака вопроса\nув(?)щевать",
                    "variants": [
                        "Е",
                        "И"
                    ],
                    "correct": "Е"
                },
                {
                    "vopros": "Какая буква должна стоять на месте знака вопроса\nраспроб(?)вать на вкус ",
                    "variants": [
                        "О",
                        "Ы"
                    ],
                    "correct": "О"
                },
                {
                    "vopros": "Какая буква должна стоять на месте знака вопроса\nотвед(?)вал",
                    "variants": [
                        "О",
                        "Ы"
                    ],
                    "correct": "Ы"
                },
                {
                    "vopros": "Выберите слово, которое написано с ошибкой",
                    "variants": [
                        "недоумевать",
                        "увещевать",
                        "обуревать",
                        "все верные",
                        "все неверные"
                    ],
                    "correct": "все верные"
                },
                {
                    "vopros": "Какая буква должна стоять на месте знака вопроса\n растл(?)вать",
                    "variants": [
                        "Е",
                        "И"
                    ],
                    "correct": "Е"
                },
                {
                    "vopros": "Выберите слово, которое написано с ошибкой",
                    "variants": [
                        "проливать",
                        "развешивать",
                        "затмивать",
                        "осваивать" 
                    ],
                    "correct": "затмивать"
                },
                {
                    "vopros": "Какая буква должна стоять на месте знака вопроса\n продл(?)вая",
                    "variants": [
                        "Е",
                        "И" 
                    ],
                    "correct": "Е"
                }
            ]
        },
        "Суффиксы причастий":{
            "photos": ["суффиксы причастий0", "суффиксы причастий1"],
            "questions":[
                {
                    "vopros": "Выберите вариант, в котором на месте пропуска пишется буква Я",
                    "variants": [
                        "броса...щий мяч",
                        "брош...нный вдаль",
                        "верт...щийся вокруг хвоста",
                        "во...щий волк"
                    ],
                    "correct": "верт...щийся вокруг хвоста"
                },
                {
                    "vopros": "Выберите вариант, в котором на месте пропуска пишется буква У",
                    "variants": [
                        "гоня...щийся за хвостом",
                        "гон...щий волков",
                        "жал...щая оса",
                        "леч...щий врач",
                        "пиш...щий доклад"
                    ],
                    "correct": "пиш...щий доклад"
                },
                {
                    "vopros": "Выберите вариант, в котором на месте пропуска пишется буква Я",
                    "variants": [
                        "дорогосто...щие препараты",
                        "пляш...щие дети",
                        "всеми обожа....мые",
                        "реша...щие задачу",
                        "та...щее мороженое"
                    ],
                    "correct": "дорогосто...щие препараты"
                },
                {
                    "vopros": "Выберите вариант, в котором на месте пропуска пишется буква Ю",
                    "variants": [
                        "брезж...щий рассвет",
                        "бре...щийся отец",
                        "терп...щий бедствие"
                    ],
                    "correct": "бре...щийся отец"
                },
                {
                    "vopros": "Выберите вариант, в котором на месте пропуска пишется буква Я",
                    "variants": [
                        "кол...щий орехи",
                        "многознач...щее замечание",
                        "кле...щий конверты",
                        "колебл...щийся"
                    ],
                    "correct": "кле...щий конверты"
                },
                {
                    "vopros": "Выберите вариант, в котором на месте пропуска пишется буква Я",
                    "variants": [
                        "брызж...щий",
                        "знач...щий",
                        "колебл...щийся",
                        "мел...щий зерно",
                        "мол...щийся"
                    ],
                    "correct": "мол...щийся"
                },
                {
                    "vopros": "Выберите вариант, в котором на месте пропуска пишется буква Ю",
                    "variants": [
                        "гон...щий",
                        "ненавид...щий",
                        "стел...щий постель",
                        "стро...щийся",
                        "став...щий"
                    ],
                    "correct": "стел...щий постель"
                },
                {
                    "vopros": "Выберите вариант, в котором на месте пропуска пишется буква Ю",
                    "variants": [
                        "озаря...мый",
                        "избира...щий",
                        "имену...мый",
                        "верч...нный"
                    ],
                    "correct": "избира...щий"
                },
                {
                    "vopros": "Какая буква должна стоять на месте знака вопроса\nсмеш(?)нное тесто",
                    "variants": [
                        "Е",
                        "А"
                    ],
                    "correct": "Е"
                },
                {
                    "vopros": "Какая буква должна стоять на месте знака вопроса\nвыкач(?)нный из гаража автомобиль",
                    "variants": [
                        "Е",
                        "А"
                    ],
                    "correct": "Е"
                },
                {
                    "vopros": "Какая буква должна стоять на месте знака вопроса\nвыкач(?)нная из скважины вода",
                    "variants": [
                        "Е",
                        "А"
                    ],
                    "correct": "А"
                },
                {
                    "vopros": "Какая буква должна стоять на месте знака вопроса\nперемеш(?)нная глина",
                    "variants": [
                        "Е",
                        "А"
                    ],
                    "correct": "Е"
                },
                {
                    "vopros": "Какая буква должна стоять на месте знака вопроса\nперемеш(?)нные книги и тетради",
                    "variants": [
                        "Е",
                        "А"
                    ],
                    "correct": "А"
                }
            ]  
        },
        "Суффиксы прилагательных": {
            "photos": [ "Суффиксы прилагательных0" ],
            "questions":[
                {
                    "vopros": "В каком слове пропущена буква И?",
                    "variants": [
                        "гречн..вый",
                        "ливн..вый",
                        "никел..вый",
                        "назойл..вый"
                    ],
                    "correct": "назойл..вый"
                },
                {
                    "vopros": "В каком слове пропущена буква И?",
                    "variants": [
                        "черешн..вый",
                        "тюлен..вый",
                        "юрод..вый",
                        "тюл..вый"
                    ],
                    "correct": "юрод..вый"
                },
                {
                    "vopros": "В каком слове есть суффикс –ЕВ-?",
                    "variants": [
                        "недогадл..вый",    
                        "щавел..вый",
                        "участл..вый",
                        "удачл..вый"
                    ],
                    "correct": "щавел..вый"
                },
                {
                    "vopros": "В каком слове есть суффикс –ЕВ-?",
                    "variants": [
                        "ключ..вой",
                        "опрометч..вый",
                        "забывч..вый",
                        "влюбч..вый"
                    ],
                    "correct": "ключ..вой"
                },
                {
                    "vopros": "В каком слове есть суффикс –ЕВ-?",
                    "variants": [
                        "прожорл..вый",
                        "рассчётл..вый",
                        "приветл..вый",
                        "вермишел..вый"
                    ],
                    "correct": "вермишел..вый"
                },
                {
                    "vopros": "В каком слове есть суффикс -ЛИВ-?",
                    "variants": [
                        "тен..вой",
                        "отрасл..вой",
                        "гел..вый",
                        "талантл..вый"
                    ],
                    "correct": "талантл..вый"
                },
                {
                    "vopros": "Укажите вариант ответа, в котором пропущена буква Е?",
                    "variants": [
                        "нул..вой",
                        "увёртл..вый",
                        "совестл..вый",
                        "привередл..вый"
                    ],
                    "correct": "нул..вой"
                },
                {
                    "vopros": "Укажите вариант ответа, в котором пропущена буква И?",
                    "variants": [
                        "стро..вой",
                        "угодл..вый",
                        "алюмини..вый",
                        "вещ..вой"
                    ],
                    "correct": "угодл..вый"
                },
                {
                    "vopros": "Укажите вариант ответа, в котором в обоих словах пропущена буква Е?",
                    "variants": [
                        "несговорч..вый, бель..вой",
                        "купеч..ский, кокетл..вый",
                        "сирен..вый, застенч..вый",
                        "ткан..вый, приключенч..ский"
                    ],
                    "correct": "ткан..вый, приключенч..ский"
                },
                {
                    "vopros": "Укажите вариант ответа, в котором в обоих словах пропущена одна и та же буква",
                    "variants": [
                        "засушл..вый, кали..вый",
                        "дешёв..нький, оптимистич..ский",
                        "рассыпч..тый, жил..стый",
                        "мал..нький, расчётл..вый"
                    ],
                    "correct": "дешёв..нький, оптимистич..ский"
                },
                {
                    "vopros": "В каком ряду во всех суффиксах прилагательных пишется одна и та же буква",
                    "variants": [
                        "крас..вый, ткан..вый, сол..вой",
                        "отрасл..вой, мах..нький, опрометч..вый",
                        "доверч..вый, крош..чный, дождл..вый",
                        "оранж..вый, син..ватый,остр..нький"
                    ],
                    "correct": "оранж..вый, син..ватый,остр..нький"
                },
                {
                    "vopros": "В каком ряду во всех суффиксах прилагательных пишется одна и та же буква",
                    "variants": [
                        "неразборч..вый, гел..вый, ступенч..тый",
                        "завистл..вый, больш..нький, кольц..вой",
                        "милост..вый, голуб..ный, улыбч..вый",
                        "залив..стый, гост..вой, кост..ной"
                    ],
                    "correct": "милост..вый, голуб..ный, улыбч..вый"
                }
            ]
        }
    },
    "Пунктуация❇️": {
        "ССП": {
            "photos": [ "Знаки препинания в ССП0" ],
            "questions": [
                {
                    "vopros": "На месте каких цифр в предложениях должны стоять запятые?\nКругом по песку валялись безо всякого порядка обручи (1) и торчали порожние бочки.\nВой волка восходил вверх начальными полутонами (2) и задерживался долго на пронзительной ноте.\nСкрипнула дверь (3) и в нее просунулась чья-то голова.",
                    "variants": [
                        "1, 2, 3",
                        "1, 3",
                        "3",
                        "2, 3"
                    ],
                    "correct": "3"
                },
                {
                    "vopros": "Укажите предложения с пунктуационной ошибкой.\n1) Гости разъехались и в доме наступила тишина.\n2) Вскоре накрыли на стол, и все сели пить чай.\n3) Утро было тихим и ясным, и сразу как-то на душе стало легче.\n4) В узком коридорчике горела свеча и освещала тусклым светом убогое жилище.",
                    "variants": [
                        "1, 2",
                        "4",
                        "1, 3",
                        "1, 2, 3"
                    ],
                    "correct": "1, 2"
                },
                {
                    "vopros": "Укажите предложения с пунктуационной ошибкой.\n1) Археологи трудились на раскопках с утра до ночи и нашли старинные захоронения.\n2) С утра шёл дождь, и гремел гром.\n3) Толпа расступилась и все залюбовались её танцем.",
                    "variants": [
                        "1, 2, 3",
                        "2, 3",
                        "1, 3",
                        "2"
                    ],
                    "correct": "2, 3"
                },
                {
                    "vopros": "Нужно ли в предложении ставить запятую на месте знака вопроса:\nЗа окном брезжил рассвет (?) и кричали петухи.",
                    "variants": [
                        "Да",
                        "Нет"
                    ],
                    "correct": "Нет"
                },
                {
                    "vopros": "На месте каких цифр в предложениях должны стоять запятые?\nПришла весна (1) и (2) исполняя своё обещание (3) Игнат взял сына с собой на пароход (4) и вот перед Фомой развернулась новая жизнь.",
                    "variants": [
                        "1, 2, 3, 4",
                        "2, 3",
                        "1, 4",
                        "4"
                    ],
                    "correct": "1, 2, 3, 4"
                },
                {
                    "vopros": "В каком варианте ответа указаны предложения, в которых на месте знака вопроса перед союзом И должна стоять запятая?\nА) В такой момент лицо его расслаблялось (?) и он походил на обычного доброго дедушку пенсионера.\nБ) Из-за неровной гряды скал выкатилось красное солнце (?) и каждая снежинка приветствовала его нестерпимым сверканием.\nВ) Кругом сверкала сталь (?) и мелькали солдатские куртки.\nГ) Было совсем темно (?) и лишь слабые отблески уличных фонарей ложились на стены комнаты.",
                    "variants": [
                        "А, Б, В",
                        "Б, В",
                        "А, Б, Г",
                        "Б, Г"
                    ],
                    "correct": "Б, Г"
                },
                {
                    "vopros": "В каком варианте ответа указаны предложения, в которых на месте знака вопроса перед союзом И должна стоять запятая?\nА) В такой момент лицо его расслаблялось (?) и он походил на обычного доброго дедушку пенсионера.\nБ) Из-за неровной гряды скал выкатилось красное солнце (?) и каждая снежинка приветствовала его нестерпимым сверканием.\nВ) Кругом сверкала сталь (?) и мелькали солдатские куртки.\nГ) Было совсем темно (?) и лишь слабые отблески уличных фонарей ложились на стены комнаты.",
                    "variants": [
                        "А, Б, В",
                        "Б, В",
                        "А, Б, Г",
                        "Б, Г"
                    ],
                    "correct": "Б, Г"
                },
                {
                    "vopros": "Нужно ли в предложении ставить запятую на месте знака вопроса:\nЯ стал читать (?) и во мне проявилась охота к литературе.",
                    "variants": [
                        "Да",
                        "Нет"
                    ],
                    "correct": "Да"
                },
                {
                    "vopros": "Нужно ли в предложении ставить запятую на месте знака вопроса:\nОчевидно, будет тепло (?) и пойдут грибы",
                    "variants": [
                        "Да",
                        "Нет"
                    ],
                    "correct": "Нет"
                },
                {
                    "vopros": "Нужно ли в предложении ставить запятую на месте знака вопроса:\nНа террасе ещё долго кипел самовар (?) и сидели гости.",
                    "variants": [
                        "Да",
                        "Нет"
                    ],
                    "correct": "Нет"
                }
            ]
        },
        "СПП": {
            "photos": [ "Знаки препинания в СПП0", "Знаки препинания в СПП1", "Знаки препинания в СПП2", "Знаки препинания в СПП3" ],
            "questions": [
                {
                    "vopros": "В каком варианте ответа правильно указаны все цифры, на месте которых должны стоять запятые?\nУ всех (1) кто прошёл войну (2) терял своих лучших товарищей (3) есть острое ощущение того (4) что жить надо достойно.",
                    "variants": [
                        "1, 2, 3, 4",
                        "1, 2",
                        "1, 2, 3",
                        "1, 3"
                    ],
                    "correct": "1, 2, 3, 4"
                },
                {
                    "vopros": "В каком варианте ответа правильно указаны все цифры, на месте которых должны стоять запятые?\nВсё дело было в той атмосфере сказки (1) в которую я погрузился (2) и (3) которая тотчас пробудила в душе добрые (4) и светлые чувства.",
                    "variants": [
                        "1",
                        "1, 2",
                        "1, 2, 3",
                        "1, 4"
                    ],
                    "correct": "1"
                },
                {
                    "vopros": "В каком варианте ответа правильно указаны все цифры, на месте которых должны стоять запятые?\nМне казалось (1)  что я каким-то чудом попал из двадцатого века во времена Ивана Калиты (2) и что (3) если сойти с парохода (4) то тут же пропадёшь.",
                    "variants": [
                        "1, 4",
                        "1, 2, 3, 4",
                        "1, 4",
                        "2, 3, 4"
                    ],
                    "correct": "1, 4"
                },
                {
                    "vopros": "Нужно ли ставить запятую в предложении на месте знака вопроса:\nМы вернемся, но не знаем (?) когда",
                    "variants": [
                        "Да",
                        "Нет"
                    ],
                    "correct": "Нет"
                },
                {
                    "vopros": "Нужно ли ставить запятую в предложении на месте знака вопроса:\nЯ пришел (?) не когда вы просили, а когда смог",
                    "variants": [
                        "Да",
                        "Нет"
                    ],
                    "correct": "Нет"
                },
                {
                    "vopros": "В каком варианте ответа правильно указаны все цифры, на месте которых должны стоять запятые?\nРазнообразие и сила света вызвали у Чайковского то состояние (1) когда (2) кажется (3) будто вот-вот случится (4) что-то необыкновенное.",
                    "variants": [
                        "1, 3",
                        "1, 2, 3, 4",
                        "1, 4",
                        "1"
                    ],
                    "correct": "1, 3"
                },
                {
                    "vopros": "В каком варианте ответа правильно указаны все цифры, на месте которых должны стоять запятые?\nЯ был уверен (1) что (2) если (3) я смогу с ним поговорить (4) он мне во всем признается",
                    "variants": [
                        "1, 2, 4",
                        "1, 2, 3",
                        "1, 4",
                        "2, 4"
                    ],
                    "correct": "1, 2, 4"
                },
                {
                    "vopros": "В каком варианте ответа правильно указаны все цифры, на месте которых должны стоять запятые?\nОбычно отец уверял (1) что еще слишком (2) рано (3) и лед еще не застыл (4) в достаточной степени",
                    "variants": [
                        "1",
                        "1, 2",
                        "2, 4",
                        "1, 2, 4"
                    ],
                    "correct": "1"
                }
                
                

            ]
        },
        "БСП": {
            "photos": [ "Знаки препинания в БСП0" ],
            "questions": [
                {
                    "vopros": "Какой знак препинания нужен для разделения частей БСП:\nОна села в кресло, долго смотрела на язычок огня (?) он даже не вздрагивал",
                    "variants": [
                        "Тире",
                        "Двоеточие",
                        "Точка с запятой",
                        "Запятая"
                    ],
                    "correct": "Двоеточие"
                },
                {
                    "vopros": "В каких предложениях знаки препинания расставлены неправильно?\nА) Влага под землю весной просочится — выше поднимется в поле пшеница.\nБ) Вы улыбнетесь — мне отрада. Вы отвернетесь — мне тоска.\nВ) Алексей был доволен — танцевальные успехи укрепляли в нем уверенность в том, что он будет летать.\nГ) Не хочешь отвечать: я скажу.",
                    "variants": [
                        "В, Г",
                        "А, Б",
                        "А, Б, В",
                        "Б, В, Г"
                    ],
                    "correct": "В, Г"
                },
                {
                    "vopros": "В каких предложениях знаки препинания расставлены неправильно?\nА) Тьма свету не любит: злой доброго не терпит.\nБ) Останавливаться было нельзя: ноги быстро засасывало.\nВ) Я знал - удар судьбы меня не обойдет.\nГ) Мечик несколько раз оглянулся: погони больше не было.",
                    "variants": [
                        "А, В",
                        "А, Б",
                        "А, Б, В",
                        "Б, В, Г"
                    ],
                    "correct": "А, В"
                },
                {
                    "vopros": "В каких предложениях знаки препинания расставлены неправильно?\nА) Куковали кукушки, постукивали дятлы, перепархивали дрозды.\nБ) На дворе палил зной: в доме было прохладно.\nВ) Я знаю: вы не осудите меня.\n Г) Степан боялся подойти к обрыву - скользко.",
                    "variants": [
                        "Б, Г",
                        "А, Б",
                        "А, Б, В",
                        "Б, В, Г"
                    ],
                    "correct": "Б, Г"
                },
                {
                    "vopros": "Определите бессоюзное сложное предложение с пропущенным тире (знаки не расставлены).",
                    "variants": [
                        "Май холодный год хлебородный",
                        "Я доверяю любящим они великодушны",
                        "Тихо пахать не годится вместо хлеба трава уродится",
                        "Я сильно прозяб холод успел проникнуть через одежду"
                    ],
                    "correct": "Май холодный год хлебородный"
                },
                {
                    "vopros": "Определите бессоюзное сложное предложение с пропущенным тире (знаки не расставлены).",
                    "variants": [
                        "Я доверяю любящим они великодушны",
                        "Поспешишь людей насмешишь",
                        "Тихо пахать не годится вместо хлеба трава уродится",
                        "Я поглядел кругом торжественно и царственно стояла ночь"
                    ],
                    "correct": "Поспешишь людей насмешишь"
                },
                {
                    "vopros": "Определите бессоюзное сложное предложение с пропущенным двоеточием (знаки не расставлены).",
                    "variants": [
                        "Май холодный год хлебородный",
                        "Ученье красота неученье слепота",
                        "Я поглядел кругом торжественно и царственно стояла ночь",
                        "Поспешишь людей насмешишь"
                    ],
                    "correct": "Я поглядел кругом торжественно и царственно стояла ночь"
                },
                {
                    "vopros": "Определите бессоюзное сложное предложение с пропущенным двоеточием (знаки не расставлены).",
                    "variants": [
                        "Тьма света не любит злой доброго не терпит",
                        "Ученье красота неученье слепота",
                        "За всё браться ничего не сделать",
                        "Я доверяю любящим они великодушны"
                    ],
                    "correct": "Я доверяю любящим они великодушны"
                }
            ]
        },
        "Тире": {
            "photos": [ "Тире0", "Тире1", "Тире2", "Тире3" ],
            "questions": [
                {
                    "vopros": "В каком из предложений нужно поставить тире? (знаки не расставлены)",
                    "variants": [
                        "Синтаксис это раздел науки о языке",
                        "Их дом как проходной двор",
                        "Цветок очень красивый",
                        "Он участник конкурса"
                    ],
                    "correct": "Синтаксис это раздел науки о языке"
                },
                {
                    "vopros": "В каком из предложений не нужно ставить тире? (знаки не расставлены)",
                    "variants": [
                        "Наш кот Борис ни рыба ни мясо",
                        "Петров всего лишь помощник воспитателя",
                        "Его любимое число девять",
                        "Его цель победить в соревнованиях"
                    ],
                    "correct": "Петров всего лишь помощник воспитателя"
                },
                {
                    "vopros": "В каком предложении допущена ошибка в постановке знаков препинания?",
                    "variants": [
                        "Кукуруза - царица полей",
                        "Вышивать - мое хобби",
                        "Кипрей это - иван-чай",
                        "Два и три - пять"
                    ],
                    "correct": "Кипрей это - иван-чай"
                },
                {
                    "vopros": "Выберите предложение, в котором между подлежащим и сказуемым нужно поставить тире",
                    "variants": [
                        "Обманывать плохо",
                        "Дождь идет",
                        "Лев животное",
                        "Гоша хороший"
                    ],
                    "correct": "Лев животное"
                },
                {
                    "vopros": "Выберите предложения, в которых между подлежащим и сказуемым нужно поставить тире:\nA) Известный ученый с успехом выступил на конференции\nБ) Настя упорная и трудолюбивая\nВ) Васнецов выдающийся художник\nГ) Пушкин поэт",
                    "variants": [
                        "А, Б",
                        "В, Г",
                        "А, Б, Г",
                        "Б, В, Г"
                    ],
                    "correct": "В, Г"
                },
                {
                    "vopros": "В каком предложении не ставится тире?",
                    "variants": [
                        "Грузинские деревни__это сплошные сады.",
                        "Прилет журавлей__есть признак весны",
                        "Агата Кристи__самый популярный автор детективного жанра",
                        "Приезд в Москву этого эстрадного артиста__важное событие"
                    ],
                    "correct": "Прилет журавлей__есть признак весны"
                },
                {
                    "vopros": "В каком предложении не ставится тире?",
                    "variants": [
                        "Расточать восторги__признак ограниченности понимания и вкуса",
                        "Наш долг__совершенствовать знания",
                        "Эти равнины__словно море бескрайнее",
                        "Безумство храбрых__вот мудрость жизни"
                    ],
                    "correct": "Эти равнины__словно море бескрайнее"
                },
                {
                    "vopros": "В каком предложении ставится тире?",
                    "variants": [
                        "Твои радость и горе__это радость и горе для меня",
                        "Этот яркий свет__словно ливень золотой",
                        "Наш край__богат и прекрасен",
                        "Снег__словно шелк"
                    ],
                    "correct": "Твои радость и горе__это радость и горе для меня"
                },
                {
                    "vopros": "В каком предложении ставится тире?",
                    "variants": [
                        "Одна беда еще__не беда",
                        "Принятый сотрудник, кажется,__хороший специалист",
                        "Сегодня небо__как море",
                        "Превосходная должность__быть на земле человеком"
                    ],
                    "correct": "Превосходная должность__быть на земле человеком"
                },
                {
                    "vopros": "Какое окончание предложения «Книга ...» нужно выбрать, чтобы между частями ставилось тире?",
                    "variants": [
                        "не стоит на полке, а лежит на столе",
                        "не нужна, я куплю только журнал",
                        "интересный собеседник"
                    ],
                    "correct": "интересный собеседник"
                }
            ]
        },
        "Однородные члены предложения": {
            "photos": [ "Однородные члены предложения0" ],
            "questions": [
                {
                    "vopros": "В каком из вариантов между однородными членами предложения ставится запятая",
                    "variants": [
                        "У нас дома нет ни компьютера (?) ни телевизора",
                        "Белые (?) и желтые лилии росли в садике у Маши",
                        "Я мог поехать к друзьям (?) или домой",
                        "Мальчик любил сидеть в тени шелковицы и читать книгу"
                    ],
                    "correct": "У нас дома нет ни компьютера (?) ни телевизора"
                },
                {
                    "vopros": "В каком из вариантов между однородными членами предложения не ставится запятая?",
                    "variants": [
                        "Актер то громко выкрикивал слова (?) то переходил на едва различимый шепот",
                        "Ане нравились книги об истории (?) и археологии",
                        "Выбирай не красные (?) а зеленые яблоки",
                        "Я не только хорошо играю на гитаре (?) но и пишу музыку"
                    ],
                    "correct": "Ане нравились книги об истории (?) и археологии"
                },
                {
                    "vopros": "В каком из предложений с однородными членами допущена пунктуационная ошибка?",
                    "variants": [
                        "Ученик положил в портфель ручки и тетради",
                        "Котенок забрался на дерево, но не смог слезть",
                        "Сразу после звонка дети шумно вбежали в класс",
                        "Сережа, и Андрей играли во дворе в футбол"
                    ],
                    "correct": "Сережа, и Андрей играли во дворе в футбол"
                },
                {
                    "vopros": "Укажите предложение, в котором нужно поставить одну запятую. (Знаки препинания не расставлены)",
                    "variants": [
                        "Тут были фарфоровые собачки слон глиняный мальчишка и много карточек в рамках",
                        "Невнятные шорохи и тихий звон в густых вершинах встречали путников",
                        "Дaлеко внизу остaлись сходни и мостки со следaми цементa и глины нa доскaх",
                        "Море кричало пенилось и вышвыривало на берег огромные седые волны"
                    ],
                    "correct": "Море кричало пенилось и вышвыривало на берег огромные седые волны"
                },
                {
                    "vopros": "Укажите предложение, в котором нужно поставить одну запятую. (Знаки препинания не расставлены)",
                    "variants": [
                        "Вода в реке перестает утомительно блестеть и принимает вид спокойной и прозрачной глади",
                        "Походы через тёмный глухой бор закалили не только мышцы Глебки но и его характер",
                        "Природа не обидела Захарова ни ростом ни телосложением ни лицом",
                        "Нарушали мертвую тишину шаги вахтенных и мерный всплеск волн у бортов"
                    ],
                    "correct": "Походы через тёмный глухой бор закалили не только мышцы Глебки но и его характер"
                },
                {
                    "vopros": "Укажите предложение, в котором нужно поставить одну запятую. (Знаки препинания не расставлены)",
                    "variants": [
                        "В походе надо сообразоваться не только силами людей но и силами животных",
                        "Дорога забирается в лес и вновь выбегает в серую пелену полей и кустов",
                        "Всюду только вода горы ревущей воды и водяные пропасти обвалы",
                        "У поручней стоял толстый и коренастый мужчина и смотрел на двигающиеся корабли"
                    ],
                    "correct": "В походе надо сообразоваться не только силами людей но и силами животных"
                },
                {
                    "vopros": "Укажите предложение, в котором нужно поставить одну запятую. (Знаки препинания не расставлены)",
                    "variants": [
                        "Миша пытался представить и луг и Кузьмина и Николая и толпу вокруг них",
                        "Я находил книгу под подушкой у мамы или случайно замечал её портфеле",
                        "Я много раз просыпался и каждый раз слышал то удары тарелок то стук колес",
                        "Над полем собиралась туча но как-то всё не решалась плотно обхватить небо"
                    ],
                    "correct": "Над полем собиралась туча но как-то всё не решалась плотно обхватить небо"
                },
                {
                    "vopros": "В каком предложении правильно расставлены знаки препинания",
                    "variants": [
                        "Грачей пролетные стада кричат, и весело, и важно",
                        "Гром уже грохотал и впереди, и справа, и слева",
                        "Победу дает отличная выручка, да взаимная выучка"
                    ],
                    "correct": "Гром уже грохотал и впереди, и справа, и слева"
                },
                {
                    "vopros": "Укажите предложение, в котором нужно поставить одну запятую. (Знаки препинания не расставлены)",
                    "variants": [
                        "Споры грибов хорошо сохраняются как при высоких так и при низких температурах",
                        "В своих картинах Левитан не уходил в сказочный мир или в древнерусскую старину",
                        "Здесь и небо и воздух и зелень придают картине высшую степень одухотворённости",
                        "Вечером отец обычно рассказывал мне сказки или читал стихи"
                    ],
                    "correct": "Споры грибов хорошо сохраняются как при высоких так и при низких температурах"
                },
                {
                    "vopros": "В каком предложении правильно расставлены знаки препинания при однородных членах",
                    "variants": [
                        "В поэзии Некрасова есть и злоба и сарказм, и нежность и надежда",
                        "Снег лежал и на крыше, и на балконе, и на деревьях",
                        "На севере туча росла и захватывала запад, и восток"
                    ],
                    "correct": "Снег лежал и на крыше, и на балконе, и на деревьях"
                }
            ]
        },
        "Приложения":{
            "photos": [ "Приложения0"],
            "questions": [
                {
                    "vopros": "В каком из этих предложений есть обособленное приложение (знаки препинания не расставлены)?",
                    "variants": [
                        "Им малым детям меня не понять",
                        "Рядом протекала река Москва",
                        "Он известен как пейзажист"
                    ],
                    "correct": "Им малым детям меня не понять"
                },
                {
                    "vopros": "В каком из предложений приложение не обособляется (знаки препинания не расставлены)?",
                    "variants": [
                        "Удачливый игрок он не знал счета деньгам",
                        "Профессор химии Смирнов работал на кафедре",
                        "Серегин мой одноклассник занимался моделированием"
                    ],
                    "correct": "Профессор химии Смирнов работал на кафедре"
                },
                {
                    "vopros": "Нужно ли ставить запятые на месте знаков вопроса?\nСосед мой (?) хирург (?) был вечно занят",
                    "variants": [
                        "Да",
                        "Нет"
                    ],
                    "correct": "Да"
                },
                {
                    "vopros": "Нужно ли ставить запятую в предложении на месте знака вопроса:\nКак человек образованный (?) наш дедушка хорошо знал историю",
                    "variants": [
                        "Да",
                        "Нет"
                    ],
                    "correct": "Да"
                },
                {
                    "vopros": "На месте каких цифр в предложении должны стоять запятые?\nПрекрасный наладчик станков (1) Дубров (2) был нарасхват в цеху",
                    "variants": [
                        "1",
                        "2",
                        "1, 2"
                    ],
                    "correct": "1"
                },
                {
                    "vopros": "Какой знак препинания нужно поставить в предложении на месте знака вопроса?\nЯ не слишком люблю это дерево (?) осину",
                    "variants": [
                        "Запятая",
                        "Двоеточие",
                        "Тире",
                        "Ничего не надо ставить"
                    ],
                    "correct": "Тире"
                },
                {
                    "vopros": "В каком варианте НЕ НУЖНО ставить дефис между словами",
                    "variants": [
                        "Москва(?)река",
                        "Ученый(?)филолог",
                        "Художник(?)самоучка",
                        "Рак(?)отшельник",
                        "Искусник(?)повар"
                    ],
                    "correct": "Искусник(?)повар"
                },
                {
                    "vopros": "В каком варианте НЕ НУЖНО ставить дефис между словами",
                    "variants": [
                        "Бедняк(?)крестьянин",
                        "Ученый(?)филолог",
                        "Женщина(?)врач",
                        "Старик(?)отец",
                        "Товарищ(?)генерал"
                    ],
                    "correct": "Товарищ(?)генерал"
                },
                {
                    "vopros": "В каком варианте НУЖНО ставить дефис между словами",
                    "variants": [
                        "Жук(?)носорог",
                        "Река(?)Москва",
                        "Суп(?)харчо",
                        "Господин(?)посол"
                    ],
                    "correct": "Жук(?)носорог"
                }
            ]
        },
        "Обособление определений": {
            "photos": [ "Обособление определений1", "Обособление определений2"],
            "questions": [
                {
                    "vopros": "В каком предложении определение не обособляется?(знаки не расставлены)",
                    "variants": [
                        "Ветер злой и холодный запел свою песню",
                        "Тягучая и властная тишина овладела лесом",
                        "Падают яблоки крупные спелые"
                    ],
                    "correct": "Тягучая и властная тишина овладела лесом"
                },
                {
                    "vopros": "В каком предложении согласованное определение не обособляется?(знаки не расставлены)",
                    "variants": [
                        "Она усталая не могла идти дальше",
                        "Утомленный долгой речью я закрыл глаза",
                        "Ровная и стройная сосна красовалась на опушке"
                    ],
                    "correct": "Ровная и стройная сосна красовалась на опушке"
                },
                {
                    "vopros": "В каком предложении определение, выраженное причастным оборотом, не обособляется?",
                    "variants": [
                        "В воздухе закружилась листва сорванная с деревьев и мелкие сучья",
                        "Над заливом еще не успевшим замерзнуть с криком носились чайки",
                        "Дувший с моря ветер подгонял лодку"
                    ],
                    "correct": "Дувший с моря ветер подгонял лодку"
                },
                {
                    "vopros": "Сколько запятых нужно поставить в предложении:\nСтоявшие по колено в сугробах ели были громадно высоки",
                    "variants": [
                        "Ни одной",
                        "Одну",
                        "Две",
                        "Три"
                    ],
                    "correct": "Ни одной"
                },
                {
                    "vopros": "Сколько запятых нужно поставить предложении:\nДождь нудный и бесконечный все еще лил и лил",
                    "variants": [
                        "Ни одной",
                        "Одну",
                        "Две",
                        "Три"                    
                    ],
                    "correct": "Две"
                },
                {
                    "vopros": "Нужно ли ставить запятую в предложении:\nОглушенный падением Григорий еле поднялся на ноги",
                    "variants": [
                        "Да",
                        "Нет"            
                    ],
                    "correct": "Да"
                },
                {
                    "vopros": "Сколько запятых нужно поставить предложении:\nБыла белая ночь облачная и тихая",
                    "variants": [
                        "Ни одной",
                        "Одну",
                        "Две",
                        "Три"             
                    ],
                    "correct": "Одну"
                },
                {
                    "vopros": "Нужно ли ставить запятые в предложении на месте знаков вопроса:\nИ (?) мрачнее черной ночи (?) он потупил грозны очи",
                    "variants": [
                        "Да",
                        "Нет"
                    ],
                    "correct": "Да"
                },
                {
                    "vopros": "Нужно ли ставить запятые в предложении на месте знаков вопроса:\nАфанасий Лукич (?) без шапки и с растрепанными волосами (?) бежал впереди всех",
                    "variants": [
                        "Да",
                        "Нет"
                    ],
                    "correct": "Да"
                },
                {
                    "vopros": "Нужно ли ставить запятую в предложении на месте знака вопроса:\nВышедший из леса (?) охотник явно был недоволен",
                    "variants": [
                        "Да",
                        "Нет"
                    ],
                    "correct": "Нет"
                },
                {
                    "vopros": "Нужно ли ставить запятую в предложении на месте знака вопроса:\nРаспластанные на траве (?) сушились рубахи и штаны",
                    "variants": [
                        "Да",
                        "Нет"
                    ],
                    "correct": "Да"
                }
            ]
        },
        "Обособление обстоятельств": {
            "photos": [ "Обособление обстоятельств1" ],
            "questions": [
                {
                    "vopros": "В каком варианте необходимо выделить запятыми обстоятельство?",
                    "variants": [
                        "Выполняли они свою работу спустя рукава",
                        "Он постоял несколько минут молча",
                        "Несмотря на усталось друзья отправились в путь",
                        "Ленивый сидя спит, лежа работает"
                    ],
                    "correct": "Несмотря на усталось путешественники отправились в путь"
                },
                {
                    "vopros": "Укажите предложение, в котором не нужно обособлять одиночное деепричастие",
                    "variants": [
                        "Прощаясь молодые люди раскланивались",
                        "Отец не оборачиваясь кивнул головой",
                        "Смотрел на бабушку прищурясь",
                        "Мальчик вздрогнув уронил ложку"
                    ],
                    "correct": "Смотрел на бабушку прищурясь"
                },
                {
                    "vopros": "Укажите предложение, в котором нет пунктуационных ошибок",
                    "variants": [
                        "Снег сошел, оставшись кое-где грязными клочками в лощинах",
                        "Воробьи обсыпав придорожные ветлы, кричали громко",
                        "Я долго сидел у окна, не зажигая огни и глядел в темное пространство",
                        "Оглянувшись, и, никого не обнаружив он стал пробираться к дому"
                    ],
                    "correct": "Снег сошел, оставшись кое-где грязными клочками в лощинах"
                },
                {
                    "vopros": "В каком варианте ответов правильно указаны все цифры, на месте которых в предложении должны стоять запятые?\nВступая в спор (1) и отстаивая свою позицию (2) мы начинаем горячиться (3) и (4) сами того не замечая (5) допускаем досадную грубость",
                    "variants": [
                        "1, 2, 3",
                        "2, 4, 5",
                        "1, 2, 3, 4",
                        "2, 3, 4, 5"
                    ],
                    "correct": "2, 4, 5"
                },
                {
                    "vopros": "Сколько запятых нужно поставить в предложении:\nКороль стоял задумавшись",
                    "variants": [
                        "Одну",
                        "Две",
                        "Ни одной"
                    ],
                    "correct": "Ни одной"
                },
                {
                    "vopros": "В каком варианте ответа правильно указаны предложения, в кото­рых на месте пропуска должны стоять запятые?\nA) Не сказав никому ни слова … он повернулся и вышел\nБ) Солдаты ещё несколько секунд лежали … затаив дыхание\nВ) Несмотря на ранние осенние сумерки … жизнь на улице била ключом\nГ) Испугавшись крика филина, мальчишки бежали … сломя голову",
                    "variants": [
                        "Б, Г",
                        "В, Г",
                        "А, В",
                        "Б, В"
                    ],
                    "correct": "А, В"
                },
                {
                    "vopros": "Укажите, на месте каких цифр в предложении должны стоять запятые\nМы слушали (1) затаив дыхание (2) рассказ дедуш­ки о том, как он трудился (3) не покладая рук",
                    "variants": [
                        "1, 2",
                        "1, 2, 3",
                        "Ни в одной",
                        "1, 3"
                    ],
                    "correct": "Ни в одной"
                },
                {
                    "vopros": "Нужно ли в предложении на месте пропуска ставить запятую\nБабушка не любила сидеть ... сложа руки",
                    "variants": [
                        "Нужно",
                        "Не нужно"
                    ],
                    "correct": "Не нужно"
                }

            ]
        },
        "Обособление дополнений": {
            "photos": [ "Обособление дополнений0" ],
            "questions": [
                {
                    "vopros": "В каком из предложений дополнение не будет обособляться(знаки препинания не расставлены)?",
                    "variants": [
                        "У них вместо стульев кресла",
                        "Он вместо ответа покачал головой",
                        "Никто не пришел на субботник кроме нас",
                        "Нет правильного ответа"
                    ],
                    "correct": "У них вместо стульев кресла"
                },
                {
                    "vopros": "Укажите, на месте каких цифр в предложении должны стоять запятые\nПриблизившись к перекрестку (1) я (2) помимо воли (3) свернул на знакомую улицу (4) и (5) только пройдя метров пятнадцать (6) спохватился и пошел обратно",
                    "variants": [
                        "2, 3, 4",
                        "1, 3, 4",
                        "1, 2, 5, 6",
                        "1, 2, 3, 5, 6"
                    ],
                    "correct": "1, 2, 3, 5, 6"
                },
                {
                    "vopros": "На месте каких цифр должны стоять запятые?\nA) Вместо веселой петербургской жизни ожидала меня скука в стороне глухой и отдаленной\nБ) Вместо лампы и свечи горел яркий веерообразный огонек\nВ) Вместо шляпы поглядевшись в зеркало он надел шапку\nГ) Вместо увольнения лучше перейти на полставки",
                    "variants": [
                        "В, Г",
                        "А, Б, В, Г",
                        "А, В",
                        "Б, Г"
                    ],
                    "correct": "В, Г"
                },
                {
                    "vopros": "На месте каких цифр должны стоять запятые?\nЧетыре орудия поочерёдно слали снаряды туда (1) но (2) сверх Григорьева ожидания (3) орудийный огонь не внёс заметного замешательства (4) в ряды красных.",
                    "variants": [
                        "1",
                        "1, 2, 3",
                        "1, 3",
                        "1, 4"
                    ],
                    "correct": "1, 2, 3"
                },
                {
                    "vopros": "Нужно ли в этом предложении ставить запятую:\nНикита должен был работать вместо неожиданно заболевшего водителя",
                    "variants": [
                        "Да",
                        "Нет"
                    ],
                    "correct": "Нет"
                },
                {
                    "vopros": "Нужно ли в этом предложении ставить запятую:\nСогласно приказу командира отряд сменил маршрут следования",
                    "variants": [
                        "Да",
                        "Нет"
                    ],
                    "correct": "Да"
                },
                {
                    "vopros": "Сколько запятых нужно поставить в предложении:\nМногие из бойцов помимо своей винтовки были вооружены трофейными автоматами",
                    "variants": [
                        "Ни одной",
                        "Одну",
                        "Две"
                    ],
                    "correct": "Две"
                },
                {
                    "vopros": "Нужно ли в предложении ставить запятую на месте знака вопроса:\nЗа неимением другой дичи (?) я послушался моего охотника и отправился в Льгов",
                    "variants": [
                        "Да",
                        "Нет"
                    ],
                    "correct": "Да"
                }

            ]
        },
        "Уточняющие конструкции": {
            "photos": [ "Уточняющие конструкции0" ],
            "questions": [
                {
                    "vopros": "В каком предложении есть уточняющий обособленный член?",
                    "variants": [
                        "Дружеская поддержка нужна всем, особенно в тяжелые минуты",
                        "Лукошко, полное грибов, я из лесу принес",
                        "Им, спортсменам, не привыкать к физическим нагрузкам",
                        "Делая уроки, я часто заглядываю в словари"
                    ],
                    "correct": "Дружеская поддержка нужна всем, особенно в тяжелые минуты"
                },
                {
                    "vopros": "В каком предложении знаки препинания расставлены неверно?",
                    "variants": [
                        "Мы встретимся в ближайшее время, например, завтра",
                        "Как-то вечером к отцу пришел друг доктор Ливси",
                        "Награжу тебя щедро, по-царски",
                        "По вечерам он сидел в комнате, в самом углу"
                    ],
                    "correct": "Как-то вечером к отцу пришел друг доктор Ливси"
                },
                {
                    "vopros": "В каком предложении нужно поставить только одну запятую?",
                    "variants": [
                        "Цитрусовые особенно лимоны богаты витамином С",
                        "Нам помимо утренней тренировки назначили дополнительную",
                        "Давай встретимся вечером часов в семь"
                    ],
                    "correct": "Давай встретимся вечером часов в семь"
                },
                {
                    "vopros": "На месте каких цифр в предложении должны стоять запятые?\nНа озере (1) среди лесов зеленых (2) кувшинки белые (3) как звезды (4) расцвели",
                    "variants": [
                        "1, 2",
                        "1, 2, 3, 4",
                        "1, 4"
                    ],
                    "correct": "1, 2, 3, 4"
                },
                {
                    "vopros": "Укажите предложение с уточняющим обстоятельством времени",
                    "variants": [
                        "Раздался легкий, со звоном, скрежет заслонки",
                        "Врагов, или тайных недругов, у нее не было",
                        "В лесу, на поляне, бегали зайцы",
                        "Приехали мы вечером, уже к ужину"
                    ],
                    "correct": "Приехали мы вечером, уже к ужину"
                },
                {
                    "vopros": "Укажите предложение с уточняющим обстоятельством места",
                    "variants": [
                        "Здесь, в доме, были общежитие и столовая",
                        "В это утро, 15 декабря, он застал князя в его имении",
                        "Воздух был сухой и теплый, даже душный"
                    ],
                    "correct": "Здесь, в доме, были общежитие и столовая"
                },
                {
                    "vopros": "Нужно ли ставить запятые в предложении на месте знаков вопроса:\nЧасов в десять утра (?) к вокзалу пригородной железной дороги (?) подошёл электропоезд",
                    "variants": [
                        "Да",
                        "Нет"
                    ],
                    "correct": "Нет"
                },
                {
                    "vopros": "Нужно ли ставить запятые в предложении на месте знаков вопроса:\nОсенью (?) во время сбора урожая (?) шумно бывает в кедровом лесу",
                    "variants": [
                        "Да",
                        "Нет"
                    ],
                    "correct": "Да"
                },
                {
                    "vopros": "Нужно ли ставить запятые в предложении на месте знаков вопроса:\nВ морозное тихое утро (?) над крышами деревенских домов (?) столбами поднимается в небо дым",
                    "variants": [
                        "Да",
                        "Нет"
                    ],
                    "correct": "Нет"
                },
                {
                    "vopros": "Нужно ли ставить запятые в предложении на месте знаков вопроса:\nЗа прудами (?) вверх по склону (?) подымалась роща с непролазным орешником",
                    "variants": [
                        "Да",
                        "Нет"
                    ],
                    "correct": "Да"
                }

            ]

        },
        "Запятая перед союзом КАК": {
            "photos": [ "Запятая перед союзом КАК0" ],
            "questions": [
                {
                    "vopros": "В каких предложениях нужно ставить запятую на месте знака вопроса:\nА) Я помню, как вместе мы ходили в школу и (?) как играли в родном дворе\nБ) Стали его искать, а он (?) как в воду канул",
                    "variants": [
                        "Только в А",
                        "Только в Б",
                        "В обоих предложениях",
                        "Ни в одном предложении"
                    ],
                    "correct": "Ни в одном предложении"
                },
                {
                    "vopros": "В каких предложениях нужно ставить запятую на месте знака вопроса:\nА) Я долго смотрел (?) как тлели угли костра.\nБ) Я страдал за милого, доброго Ивана Андреевича (?) как за сына.",
                    "variants": [
                        "Только в А",
                        "Только в Б",
                        "В обоих предложениях",
                        "Ни в одном предложении"
                    ],
                    "correct": "Только в А"
                },
                {
                    "vopros": "В каких предложениях нужно ставить запятую на месте знака вопроса:\nА) Твои слова для меня (?) как острый нож по сердцу.\nБ) Культура исследуется целым рядом наук (?) как социальное явление.",
                    "variants": [
                        "Только в А",
                        "Только в Б",
                        "В обоих предложениях",
                        "Ни в одном предложении"
                    ],
                    "correct": "Ни в одном предложении"
                },
                {
                    "vopros": "В каких предложениях нужно ставить запятую на месте знака вопроса:\nА) Его приняли в доме (?) как родного.\nБ) Национальной науки нет (?) как нет и национальной таблицы умножения.",
                    "variants": [
                        "Только в А",
                        "Только в Б",
                        "В обоих предложениях",
                        "Ни в одном предложении"
                    ],
                    "correct": "Только в Б"
                },
                {
                    "vopros": "В каких предложениях нужно ставить запятую на месте знака вопроса:\nА) Я знал красавиц недоступных, холодных, чистых (?) как зима.\nБ) Видно было (?) как пробивается сквозь землю нежная весенняя трава.",
                    "variants": [
                        "Только в А",
                        "Только в Б",
                        "В обоих предложениях",
                        "Ни в одном предложении"
                    ],
                    "correct": "В обоих предложениях"
                },
                {
                    "vopros": "Сколько запятых нужно поставить в предложении:\nПоследний луч заходящего солнца как острая игла пронзил густую зелень деревьев",
                    "variants": [
                        "Ни одной",
                        "Одну",
                        "Две",
                        "Три"
                    ],
                    "correct": "Две"
                },
                {
                    "vopros": "На месте какиц цифр в предложении должны стоять запятые:\nНе кто иной (1) как ты (2) выполнишь это задание",
                    "variants": [
                        "1",
                        "2",
                        "1, 2",
                        "Ни в одной"
                    ],
                    "correct": "1"
                },
                {
                    "vopros": "Нужна ли запятая на месте знака вопроса в предложении:\nВ старину рябину заготавливали к зиме (?) как еду",
                    "variants": [
                        "Да",
                        "Нет"
                    ],
                    "correct": "Нет"
                },
                {
                    "vopros": "Нужна ли запятая на месте знака вопроса в предложении:\nВсе это было (?) как стрекотание кузнечика в траве",
                    "variants": [
                        "Да",
                        "Нет"
                    ],
                    "correct": "Нет"
                },
                {
                    "vopros": "Укажите предложения, в которых нужно поставить запятую перед КАК:\nА) Он был чрезвычайно известен как юрист\nБ)Мы видели как все это произошло\nВ) Дождь льет как из ведра\nГ) Мне как старшему доверили нести спички",
                    "variants": [
                        "Б, Г",
                        "А, Г",
                        "А, Б, Г",
                        "В, Г"
                    ],
                    "correct": "Б, Г"
                }

            ]
        }
    },
    "✳️Прочее✳️":{
        "Тропы и фигуры речи":{
            "photos":["Тропы0", "Фигуры речи0"],
            "questions":[
                {
                    "vopros": "Какой троп использован в предложении:\nВ сто сорок солнц закат пылал..",
                    "variants": [
                        "сравнение",
                        "эпитет",
                        "метафора",
                        "гипербола"
                    ],
                    "correct": "гипербола"
                },
                {
                    "vopros": "Какой троп использован в предложении:\nДень ясный плакал за горою...",
                    "variants": [
                        "эпитет",
                        "олицетворение",
                        "метафора",
                        "гипербола"
                    ],
                    "correct": "олицетворение"
                },
                {
                    "vopros": "Какой троп использован:\nМчался стрелою",
                    "variants": [
                        "олицетворение",
                        "сравнение",
                        "метонимия"
                    ],
                    "correct": "сравнение"
                },
                {
                    "vopros": "Какой троп использован:\nВ комнате была мертвая тишина",
                    "variants": [
                        "сравнение",
                        "литота",
                        "аллегория",
                        "метафора"
                    ],
                    "correct": "метафора"
                },
                {
                    "vopros": "Какой троп использован:\nВаш шпиц не больше наперстка",
                    "variants": [
                        "гипербола",
                        "литота",
                        "сравнение"
                    ],
                    "correct": "литота"
                },
                {
                    "vopros": "Какой троп использован:\nЯ три тарелки съел",
                    "variants": [
                        "метонимия",
                        "гипербола",
                        "сравнение",
                        "ирония"
                    ],
                    "correct": "метонимия"
                },
                {
                    "vopros": "Какой троп использован:\nЛазурь небесная смеётся",
                    "variants": [
                        "эпитет",
                        "гипербола",
                        "сравнение",
                        "синекдоха"
                    ],
                    "correct": "эпитет"
                },
                {
                    "vopros": "Какая стилистическая фигура использована:\nКлянусь я первым днём творенья, клянусь его последним днём",
                    "variants": [
                        "анафора",
                        "эпифора",
                        "антитеза",
                        "параллелизм"
                    ],
                    "correct": "анафора"
                },
                {
                    "vopros": "Какая стилистическая фигура использована:\nВывели лошадей. Не понравились они мне. Зимы ждала природа",
                    "variants": [
                        "инверсия",
                        "градация",
                        "антитеза",
                        "параллелизм"
                    ],
                    "correct": "инверсия"
                },
                {
                    "vopros": "Какая стилистическая фигура использована:\nЖенщины плачьте: ручьями, озёрами, океанами слёз!",
                    "variants": [
                        "инверсия",
                        "градация",
                        "антитеза",
                        "анафора"
                    ],
                    "correct": "градация"
                },
                {
                    "vopros": "Какая стилистическая фигура использована:\nЖивой труп, пожар льда, мертвые души",
                    "variants": [
                        "парцелляция",
                        "градация",
                        "антитеза",
                        "оксюморон"
                    ],
                    "correct": "оксюморон"
                },
                {
                    "vopros": "Какая стилистическая фигура использована:\nГде стол был яств, там гроб стоит",
                    "variants": [
                        "парцелляция",
                        "градация",
                        "антитеза",
                        "оксюморон"
                    ],
                    "correct": "антитеза"
                }
                
            ]
        },
        "Трудные ударения":{
            "photos":["Трудные ударения0"],
            "questions":[
                {
                    "vopros": "На какую букву падает ударение в слове:\nгазопровод",
                    "variants": [
                        "газопрОвод",
                        "газопровОд"
                    ],
                    "correct": "газопровОд"
                },
                {
                    "vopros": "На какую букву падает ударение в слове:\nгнала",
                    "variants": [
                        "гнАла",
                        "гналА"
                    ],
                    "correct": "гналА"
                },
                {
                    "vopros": "На какую букву падает ударение в слове:\nжалюзи",
                    "variants": [
                        "жАлюзи",
                        "жалюзИ"
                    ],
                    "correct": "жалюзИ"
                },
                {
                    "vopros": "На какую букву падает ударение в слове:\nзагнутый",
                    "variants": [
                        "зАгнутый",
                        "загнУтый"
                    ],
                    "correct": "зАгнутый"
                },
                {
                    "vopros": "На какую букву падает ударение в слове:\nзубец",
                    "variants": [
                        "зУбец",
                        "зубЕц"
                    ],
                    "correct": "зубЕц"
                },
                {
                    "vopros": "На какую букву падает ударение в слове:\nкамбала",
                    "variants": [
                        "кАмбала",
                        "камбалА"
                    ],
                    "correct": "кАмбала"
                },
                {
                    "vopros": "На какую букву падает ударение в слове:\nкрасивее",
                    "variants": [
                        "красИвее",
                        "красивЕе"
                    ],
                    "correct": "красИвее"
                },
                {
                    "vopros": "На какую букву падает ударение в слове:\nоблегчить",
                    "variants": [
                        "облегчИть",
                        "облЕгчить"
                    ],
                    "correct": "облегчИть"
                },
                {
                    "vopros": "На какую букву падает ударение в слове:\nплесневеть",
                    "variants": [
                        "плЕсневеть",
                        "плесневЕть"
                    ],
                    "correct": "плЕсневеть"
                },
                {
                    "vopros": "На какую букву падает ударение в слове:\nплодоносить",
                    "variants": [
                        "плодоносИть",
                        "плодонОсить"
                    ],
                    "correct": "плодоносИть"
                },
                {
                    "vopros": "На какую букву падает ударение в слове:\nподнятый",
                    "variants": [
                        "пОднятый",
                        "поднЯтый"
                    ],
                    "correct": "пОднятый"
                },
                {
                    "vopros": "На какую букву падает ударение в слове:\nсверлит",
                    "variants": [
                        "свЕрлит",
                        "сверлИт"
                    ],
                    "correct": "сверлИт"
                },
                {
                    "vopros": "На какую букву падает ударение в слове:\nсестринский",
                    "variants": [
                        "сЕстринский",
                        "сестрИнский"
                    ],
                    "correct": "сЕстринский"
                },
                {
                    "vopros": "На какую букву падает ударение в слове:\nсливовый",
                    "variants": [
                        "слИвововый",
                        "сливОвый"
                    ],
                    "correct": "слИвововый"
                },
                {
                    "vopros": "На какую букву падает ударение в слове:\nсредства",
                    "variants": [
                        "срЕдства",
                        "средствА"
                    ],
                    "correct":"срЕдства"
                }

            ]
        }
    }
}